Podkova/src/InformationRegisters/НастройкиУчетаМаркируемойПродукцииИСМП/НастройкиУчетаМаркируемойПродукцииИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУчетаМаркируемойПродукцииИСМП</name>
  <resources>
    <name>ВестиУчетПродукции</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОбязательнойМаркировки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукцииИС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/InformationRegisters/НастройкиУчетаМаркируемойПродукцииИСМП/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	МассивНепроверяемыхРеквизитов.Добавить("ДатаОбязательнойМаркировки");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.ВестиУчетПродукции И Запись.ДатаОбязательнойМаркировки = '00010101' Тогда
			ТекстОшибки = НСтр("ru = 'Для маркируемой продукции ""%1"" не указана дата обязательной маркировки'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, Запись.ВидПродукции);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "ДатаОбязательнойМаркировки", "Запись", Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
